# importing the enron data as a unix file
### finding the answers of the questions in chapter dataset questions

In [43]:
import pickle

enron_data = pickle.load(open("../final_project/final_project_dataset_unix.pkl", "rb"))

import pandas as pd 
df = pd.DataFrame(enron_data)

#### How many POIs are there in the E+F dataset?

to find this first we need to transpose the data to make names in rows and features of every person in columns.

In [44]:
df = df.transpose()

In [45]:
df['poi'].sum()

18

#### how many POIs exists?

In [46]:
df.reset_index(inplace = True)

In [47]:
df = df.rename({'index': 'name'}, axis=1)

In [48]:
df.head()

,name,salary,to_messages,deferral_payments,total_payments,loan_advances,bonus,email_address,restricted_stock_deferred,deferred_income,...,from_poi_to_this_person,exercised_stock_options,from_messages,other,from_this_person_to_poi,poi,long_term_incentive,shared_receipt_with_poi,restricted_stock,director_fees
0,METTS MARK,365788,807,NaN,1061827,NaN,600000,mark.metts@enron.com,NaN,NaN,...,38,NaN,29,1740,1,False,NaN,702,585062,NaN
1,BAXTER JOHN C,267102,NaN,1295738,5634343,NaN,1200000,NaN,NaN,-1386055,...,NaN,6680544,NaN,2660303,NaN,False,1586055,NaN,3942714,NaN
2,ELLIOTT STEVEN,170941,NaN,NaN,211725,NaN,350000,steven.elliott@enron.com,NaN,-400729,...,NaN,4890344,NaN,12961,NaN,False,NaN,NaN,1788391,NaN
3,CORDES WILLIAM R,NaN,764,NaN,NaN,NaN,NaN,bill.cordes@enron.com,NaN,NaN,...,10,651850,12,NaN,0,False,NaN,58,386335,NaN
4,HANNON KEVIN P,243293,1045,NaN,288682,NaN,1500000,kevin.hannon@enron.com,NaN,-3117011,...,32,5538001,32,11350,21,True,1617011,1035,853064,NaN

In [239]:
names = pd.read_csv('../final_project/poi_names.txt', delimiter = ',',skiprows = 1)

In [240]:
names.head()

     first_name last_name
0       (y) Lay   Kenneth
1  (y) Skilling   Jeffrey
2    (n) Howard     Kevin
3    (n) Krautz   Michael
4    (n) Yeager     Scott

In [241]:
names['yes/no'] = ""
for i in names.index:
    names['yes/no'][i] = names['first_name'][i].split(')')[0].strip("(")

In [242]:
for i in names.index:
    names['first_name'][i] = names['first_name'][i].split(')')[1].strip()

In [280]:
names["full_name"] = ""
for i in names.index:
    names['full_name'] =  names['last_name'] + " "+ names['first_name'].astype(str)

In [281]:
names.head()

  first_name last_name yes/no          full_name
0        Lay   Kenneth      y        Kenneth Lay
1   Skilling   Jeffrey      y   Jeffrey Skilling
2     Howard     Kevin      n       Kevin Howard
3     Krautz   Michael      n     Michael Krautz
4     Yeager     Scott      n       Scott Yeager

In [285]:
poi_list = list(names['full_name'].str.lower())

In [286]:
df['name'].str.lower().isin(poi_list).sum()

0

### What is the total value of the stock belonging to James Prentice?

In [267]:
df['name'] = df['name'].str.lower()

In [277]:
df[df['name']== 'prentice james']

,name,salary,to_messages,deferral_payments,total_payments,loan_advances,bonus,email_address,restricted_stock_deferred,deferred_income,...,from_poi_to_this_person,exercised_stock_options,from_messages,other,from_this_person_to_poi,poi,long_term_incentive,shared_receipt_with_poi,restricted_stock,director_fees
98,prentice james,NaN,NaN,564348,564348,NaN,NaN,james.prentice@enron.com,NaN,NaN,...,NaN,886231,NaN,NaN,NaN,False,NaN,NaN,208809,NaN

In [274]:
list(df.name)

['metts mark',
 'baxter john c',
 'elliott steven',
 'cordes william r',
 'hannon kevin p',
 'mordaunt kristina m',
 'meyer rockford g',
 'mcmahon jeffrey',
 'haedicke mark e',
 'piper gregory f',
 'humphrey gene e',
 'noles james l',
 'blachman jeremy m',
 'sunde martin',
 'gibbs dana r',
 'lowry charles p',
 'colwell wesley',
 'muller mark s',
 'jackson charlene r',
 'westfahl richard k',
 'walters gareth w',
 'walls jr robert h',
 'kitchen louise',
 'chan ronnie',
 'belfer robert',
 'shankman jeffrey a',
 'wodraska john',
 'bergsieker richard p',
 'urquhart john a',
 'bibi philippe a',
 'rieker paula h',
 'whaley david a',
 'beck sally w',
 'haug david l',
 'echols john b',
 'mendelsohn john',
 'hickerson gary j',
 'cline kenneth w',
 'lewis richard',
 'hayes robert e',
 'kopper michael j',
 'leff daniel p',
 'lavorato john j',
 'berberian david',
 'detmering timothy j',
 'wakeham john',
 'powers william',
 'gold joseph',
 'bannantine james m',
 'duncan john h',
 'shapiro richard s',
 'sherriff john r',
 'shelby rex',
 'lemaistre charles',
 'deffner joseph m',
 'kishkill joseph g',
 'whalley lawrence g',
 'mcconnell michael s',
 'piro jim',
 'delainey david w',
 'sullivan-shaklovitz colleen',
 'wrobel bruce',
 'lindholm tod a',
 'meyer jerome j',
 'lay kenneth l',
 'butts robert h',
 'olson cindy k',
 'mcdonald rebecca',
 'cumberland michael s',
 'gahn robert s',
 'badum james p',
 'hermann robert j',
 'fallon james b',
 'gathmann william d',
 'horton stanley c',
 'bowen jr raymond m',
 'gillis john',
 'fitzgerald jay l',
 'moran michael p',
 'redmond brian l',
 'bazelides philip j',
 'belden timothy n',
 'dimichele richard g',
 'duran william d',
 'thorn terence h',
 'fastow andrew s',
 'foy joe',
 'calger christopher f',
 'rice kenneth d',
 'kaminski wincenty j',
 'lockhart eugene e',
 'cox david',
 'overdyke jr jere c',
 'pereira paulo v. ferraz',
 'stabler frank',
 'skilling jeffrey k',
 'blake jr. norman p',
 'sherrick jeffrey b',
 'prentice james',
 'gray rodney',
 'the travel agency in the park',
 'umanoff adam s',
 'kean steven j',
 'total',
 'fowler peggy',
 'wasaff george',
 'white jr thomas e',
 'christodoulou diomedes',
 'allen phillip k',
 'sharp victoria t',
 'jaedicke robert',
 'winokur jr. herbert s',
 'brown michael',
 'mcclellan george',
 'hughes james a',
 'reynolds lawrence',
 'pickering mark r',
 'bhatnagar sanjay',
 'carter rebecca c',
 'buchanan harold g',
 'yeap soon',
 'murray julia h',
 'garland c kevin',
 'dodson keith',
 'yeager f scott',
 'hirko joseph',
 'dietrich janet r',
 'derrick jr. james v',
 'frevert mark a',
 'pai lou l',
 'hayslett roderick j',
 'bay franklin r',
 'mccarty danny j',
 'fugh john l',
 'scrimshaw matthew',
 'koenig mark e',
 'savage frank',
 'izzo lawrence l',
 'tilney elizabeth a',
 'martin amanda k',
 'buy richard b',
 'gramm wendy l',
 'causey richard a',
 'taylor mitchell s',
 'donahue jr jeffrey m',
 'glisan jr ben f']